
// === 01. 1.Перечислите основные типы данных в JS.
// string
// number
// boolean
// null
// undefined
// symbol
// object



// === 02. В каком порядке будут выведены цифры 1,2,3 ?
// console.log(1);
// setTimeout(() => console.log(2));
// console.log(3);

// result 1, 3, 2



// === 03. Существуют ли нативные классы в JS?

// My answer - No



// === 04. Что из перечисленных относится к JS?
// 1. Динамическая типизация +++
// 2. Статическая типизация ---
// 3. Многопоточность --- но можно достичь +++
// 4. Автоматическое управление памятью +++
// 5. Прототипное программирование +++



// === 05. Каким будет результат работы данного скрипта?
// 'use strict'
// function f() {
//   console.log(this);
// }
// f(); // undefined



// === 06. Каким будет результат работы данного скрипта?
// console.log(x); // undefined
// var x = 4;
// console.log(x); // 4



// === 07. Чему равна переменная foo?
// var foo = 10 + "20";
// console.log(10 + "20"); // '1020'



// === 08. Какой тип вернет оператор typeof для функции?
// var f = function() {}
// console.log(typeof f) // function



// === 09. Можно ли в JS вызвать функцию без круглых скобок? Если да, то каким образом?

// my answer = I don't konow!



// === 10. 



// === 11. 



// === 12. 
