// 'use strict';

/**
|--------------------------------------------------
  === <<<---  Quiz #1 --->>>  ===

|--------------------------------------------------
*/


/**
|--------------------------------------------------
  === <<<---  Quiz #2  --->>>  ===

|--------------------------------------------------
*/



/**
|--------------------------------------------------
  === <<<---  Quiz #3 --->>>  ===  

|--------------------------------------------------
*/


/**
|--------------------------------------------------
  === <<<---  Quiz #4 --->>>  ===

|--------------------------------------------------
*/



/**
|--------------------------------------------------
  === <<<---  Quiz #5 --->>>  ===

|--------------------------------------------------
*/


/**
|--------------------------------------------------
  === <<<---  Quiz #6 --->>>  ===

|--------------------------------------------------
*/



/**
|--------------------------------------------------
  === <<<---  Quiz #7 --->>>  ===

|--------------------------------------------------
*/



/**
|--------------------------------------------------
  === <<<---  Quiz #8 --->>>  ===

|--------------------------------------------------
*/



/**
|--------------------------------------------------
  === <<<---  Quiz #9 --->>>  ===

|--------------------------------------------------
*/



/**
|--------------------------------------------------
  === <<<---  Quiz #10 --->>>  ===

|--------------------------------------------------
*/



/**
|--------------------------------------------------
  === <<<---  Quiz #11 --->>>  ===

|--------------------------------------------------
*/




/**
|--------------------------------------------------
  === <<<---  Quiz #12 --->>>  ===

|--------------------------------------------------
*/



/**
|--------------------------------------------------
  === <<<---  Quiz #13 --->>>  ===

|--------------------------------------------------
*/


/**
|--------------------------------------------------
  === <<<---  Quiz #14 --->>>  ===

|--------------------------------------------------
*/



/**
|--------------------------------------------------
  === <<<---  Quiz #15 --->>>  ===

|--------------------------------------------------
*/



/**
|--------------------------------------------------
  === <<<---  Quiz #16  --->>>  ===

|--------------------------------------------------
*/


/**
|--------------------------------------------------
  === <<<---  Quiz #17 --->>>  ===

|--------------------------------------------------
*/



/**
|--------------------------------------------------
  === <<<---  Quiz #18  --->>>  ===

|--------------------------------------------------
*/



/**
|--------------------------------------------------
  === <<<---  Quiz #19 --->>>  ===

|--------------------------------------------------
*/



/**
 |--------------------------------------------------
 === <<<---  Quiz #20 --->>>  ===

|--------------------------------------------------
*/



/**
|--------------------------------------------------
  === <<<---  Quiz #21 --->>>  ===

|--------------------------------------------------
*/



/**
|--------------------------------------------------
  === <<<---  Quiz #22 --->>>  ===

|--------------------------------------------------
*/



/**
|--------------------------------------------------
  === <<<---  Quiz #23 --->>>  ===

|--------------------------------------------------
*/



/**
|--------------------------------------------------
  === <<<---  Quiz #24 --->>>  ===

|--------------------------------------------------
*/



/**
|--------------------------------------------------
  === <<<---  Quiz #25 --->>>  ===

|--------------------------------------------------
*/




/**
|--------------------------------------------------
  === <<<---  Quiz #26 --->>>  ===

|--------------------------------------------------
*/




/**
|--------------------------------------------------
  === <<<---  Quiz #27 --->>>  ===

|--------------------------------------------------
*/




/**
|--------------------------------------------------
  === <<<---  Quiz #28 --->>>  ===

|--------------------------------------------------
*/




/**
|--------------------------------------------------
  === <<<---  Quiz #29 --->>>  ===

|--------------------------------------------------
*/




/**
|--------------------------------------------------
  === <<<---  Quiz #30 --->>>  ===

|--------------------------------------------------
*/





// === EXAMPLES === 

// === <<<--- What will show console.log?  --->>>  ===







// const prom1 = Promise.resolve('123');
// const prom2 = Promise.resolve('error');
// const prom3 = Promise.resolve('some');
// Promise.all([prom1, prom2, prom3])
// .then(data => console.log(data))
// .catch(error => console.log(error));



/* 
В компанию Agilium Labs (https://agiliumlabs.com), специализирующуюся на разработке программного обеспечения, требуется full-stack node.js разработчик.
Ваш город проживания не имеет значения, т.к. вакансия удаленная.
Мы используем MEAN и MERN стеки, а также ряд других фреймворков.
Мы готовы рассматривать кандидатуры как начинающих, так и более опытных специалистов. Наш процесс разработки выстроен в соответствии с лучшими практиками, поэтому вакансия идеальна для специалистов, которые хотят приобрести опыт профессиональной разработки, или прокачать свои скилы как в конкретных технологиях, так и в профессиональных приемах, используемых в разработке ПО.

Минимальные требования:
опыт разработки на Javascript от 2 лет
знание node.js - фреймворк express.js
знание Angular или React.js
понимание архитектурного стиля REST
умение писать модульные и автоматизированные user acceptance тесты
понимание популярных шаблонов проектирования
знание git
самостоятельность, ответственность

Плюсом будет:
знание фреймворка serverless
опыт использования сервисов AWS
понимание архитектурного стиля microservices

Условия работы:
работа над интересными проектами
профессиональная команда
возможность использовать последние технологии и лучшие практики разработки
гибкий рабочий график
вы самостоятельно выбираете удобное для вас время работы
удаленная работа, 40 часов в неделю
достойная оплата в соответствии с уровнем ваших знаний и навыков

Просьба проявить организованность и взаимное уважение, следуя следующим простым шагам, позволяющим рационально распорядиться и Вашими и нашими ограниченными временными ресурсами.

Алгоритм найма:
Вы проходите тест по Node.js (http://www.proprofs.com/quiz-school/story.php?title=agiliumlabs-nodejs-skill-test) и один из тестов по Angular(https://www.proprofs.com/quiz-school/story.php?title=agiliumlabs-angular-2-skill-test) или React.js (https://www.proprofs.com/quiz-school/story.php?title=agiliumlabs-reactjs-skill-test), каждый из которых занимает менее 10 минут
Если ваш средний результат 60% или более, заполняете анкету https://goo.gl/forms/4cI0Qsv1zadSRDWn1.
Если вы набрали меньше баллов, вы можете прокачать свои скилы и повторить попытку через 3 месяца, предварительно написав нам на hr at agiliumlabs.com.
Вы присылаете свое резюме через отклик на эту вакансию либо на hr at agiliumlabs.com.
Мы свяжемся с вами в течение нескольких дней, чтобы запланировать беседу.
По результатам беседы мы выдадим вам оплачиваемую пробную задачу, успешное выполнение которой является пропуском в нашу команду.
Удачи Вам, ждем Ваших резюме)))
Контактное лицо: Оксана
*/